In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name": ["Akshat", "Aanis", "Bandhan"],
    "marks": [85, 80, 90],
    "city": ["Bhopal", "Gawliar", "West Bengal"]
}

In [3]:
df = pd.DataFrame(dict1)
type(df)

pandas.core.frame.DataFrame

In [4]:
df

      name  marks         city
0   Akshat     85       Bhopal
1    Aanis     80      Gawliar
2  Bandhan     90  West Bengal

In [5]:
df.to_csv("marks.csv", index=False)

In [6]:
df.head(2)

     name  marks     city
0  Akshat     85   Bhopal
1   Aanis     80  Gawliar

In [7]:
df.tail(2)

      name  marks         city
1    Aanis     80      Gawliar
2  Bandhan     90  West Bengal

In [8]:
df.describe()

       marks
count    3.0
mean    85.0
std      5.0
min     80.0
25%     82.5
50%     85.0
75%     87.5
max     90.0

In [18]:
dict2 = {
    "id": [1, 2, 3, 4],
    "salary": [85, 80, 90, 80],
}
df2 = pd.DataFrame(dict2)
df2.head()

   id  salary
0   1      85
1   2      80
2   3      90
3   4      80

In [22]:
salary_series = df2['salary']
type(salary_series)

pandas.core.series.Series

In [23]:
new_salary = salary_series.unique()
type(new_salary)

numpy.ndarray

In [25]:
new_salary.sort()

In [27]:
n = len(new_salary)

In [33]:
if n >=2:
    print(new_salary[2-1])
else:
    print("null")

85